[
  {
    "name": "Sony Music Entertainment",
    "title": "Devops engineer",
    "duration": "04/2019 - present",
    "description": "Taking on various roles and responsibilities as a devops engineer for the American music conglomerate, Sony Music.",
    "contribution": [
      "Leading the infrastructure modernisation effort of numerous internal projects",
      "Jumping into both back and front-end development on demand"
    ]
  },
  {
    "name": "SuperStronger",
    "title": "Full-stack developer",
    "duration": "07/2018 - 11/2019",
    "description": "SuperStronger is an experiment aimed towards helping people counsciously and effectively control their own habits. At the current stage of the project the main goal is to change habits related to weight, such as eating end exercising.",
    "contribution": [
      "Developing the back-end using Kotlin and Spring Boot",
      "Implementing OAuth login using Spring Security and the Facebook API",
      "Creating a front-end using Angular 6 (TypeScript)",
      "Implementing a group chat application using WebSocket + Stomp",
      "Implementing payment using Barion as backend",
      "Building a basic infrastructure on AWS"
    ]
  },
  {
    "name": "<a href='https://mikeron.hu'>Mikeron.hu</a>",
    "title": "Full-stack developer",
    "duration": "03/2018 - 04/2018",
    "description": "Developed a portfolio website for Mikeron, a Hungary based industrial ceramics manufacturer.",
    "contribution": [
      "Setting up infrastructure requirements including domain registration and hosting",
      "Designing the webpage in close cooperation with the client",
      "Organizing and uploading the page content",
      "Optimizing the page for search engines"
    ]
  },
  {
    "name": "Yngage",
    "title": "Full-stack developer",
    "duration": "01/2018 - 09/2018",
    "description": "An employee satisfaction survey service specifically targeting the \"Y\" generation.",
    "contribution": [
      "Developing the back-end using Laravel",
      "Creating a front-end using Vue.js",
      "Implementing administrator functionalities for managing surveys",
      "Building a <a href='https://yngage.hu'>home page</a> based on the client's specifications"
    ]
  },
  {
    "name": "GE Healthcare Analytics Framework",
    "title": "Back-end developer",
    "duration": "06/2016 - 03/2017",
    "description": "A microservices based application for storing, combining and executing medical algorithms.",
    "contribution": [
      "Setting up the service skeletons, prototyping the service-to-service communication using AMQP",
      "Participating in the design and implementation of the algorithm orchestration DSL"
    ]
  }
]
